[BalanceDefs.ID_LostHectorECHO02 MissionItemDefinition]
UseFailureCharacterMessage="It should be like this %s use this article."
ItemName="Echoes of Hector's loss"
PickupMessage="It depends on you %s"
UseFailureLevelMessage="You must be %d or older to use this element."
UseFailureConstraintsMessage="You cannot use it.."
NoManufacturerName="Most of the time"

[BalanceDefs.ID_LostHectorECHO02:AttributePresentationDefinition_1 AttributePresentationDefinition]
Description="Be careful my friend!"
NoConstraintText=""
Suffix=""
Prefix=""

[InteractiveObjects.IO_HectorSafe InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[IO_ECHOLog_MissionGiver InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[IO_ECHOLog_TempTurnIn InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[IO_ElectricalFuseBoxECHO InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[IO_HectorChest InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[ItemDefs.ID_LostHectorEcho MissionItemDefinition]
UseFailureCharacterMessage="you should %s Use this article.."
ItemName="Ettore defeated ECHO"
PickupMessage="Hooray %s"
UseFailureLevelMessage="You must be at least %d level to use this item."
UseFailureConstraintsMessage="You cannot use this item.."
NoManufacturerName="normal"

[ItemDefs.ID_LostHectorEcho03 MissionItemDefinition]
UseFailureCharacterMessage="important %s Use this tool."
ItemName="ECHO Ector is gone"
PickupMessage="you have _ %s"
UseFailureLevelMessage="You must be at least %d old to use this feature.."
UseFailureConstraintsMessage="You cannot use it."
NoManufacturerName="generally"

[ItemDefs.ID_LostHectorEcho03:AttributePresentationDefinition_2 AttributePresentationDefinition]
Description="Take this story to a friend!"
NoConstraintText=""
Suffix=""
Prefix=""

[ItemDefs.ID_LostHectorEcho:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Take a friendly story!"
NoConstraintText=""
Suffix=""
Prefix=""

[M_Anemone_EchoesOfThePast MissionDefinition]
MissionName="Echoes of the past"
MissionDescription="See the ECHO report on Colonel Hector's arrival at Pandora. Unfortunately, he seems to have turned into an obsessive person.."
TurnInDescription="In line; Why did Dahal leave his crew in a terrible wasteland? What are the possibilities??"
MissionSummary="Receive an ECHO message from Colonel Hector.."
MissionGiver="He lost the election"
MissionTurnInLocation="Echo disappeared"
TeaserText="They received Colonel Hector's reply. Listen to this music and see what you can learn about Pandora's new story.."

[M_Anemone_EchoesOfThePast:FindFirstEcho MissionObjectiveDefinition]
ProgressMessage="Do an ultrasound first."

[M_Anemone_EchoesOfThePast:FindSecondEcho MissionObjectiveDefinition]
ProgressMessage="Get the second ring"

[M_Anemone_EchoesOfThePast:FindThirdEcho MissionObjectiveDefinition]
ProgressMessage="Get the third EHO."

[M_Anemone_EchoesOfThePast:SET_PickupfirstEcho MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_EchoesOfThePast:SET_PickUpSecondEcho MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_EchoesOfThePast:SET_PickUpThirdEcho MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

